Tekla Open API Reference for Tekla Structures 2025
AnalysisModelDesignProperties.SteelDesignMethod Property
 The steel design method.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisModelDesignProperties.DesignMethodEnum SteelDesignMethod { get; set; }
Public Property SteelDesignMethod As AnalysisModelDesignProperties.DesignMethodEnum
	Get
	Set
Property Value
Type: AnalysisModelDesignProperties.DesignMethodEnum
See Also
Reference
AnalysisModelDesignProperties Class
Tekla.Structures.Analysis Namespace